CONTRACTOR_START_BOT = (
    'Здравстуйте, для того что бы пользователься ботом, введите трек-номер, который вам дало отвественное лицо'
)

ADMIN_START_BOT = (
    'Здравтсвуйте, вы являетесь администратором данного бота'
)

WRONG_TOKEN = (
    'Вы ввели неправильный трек-номер'
)

SUCCESSFUL_AUTH = (
    'Вы вошли как подрядчик <b>{}</b>'
)

START_FILL_FORM = (
    'Вы начали заполнение формы. Если хотите отменить заполнение, нажмите на кнопку <b>Отмена</b>'
)

CANCEL_FILL_FORM = (
    'Вы отменили заполнение формы. Если хотите начать заново, нажмите на кнопку <b>Внести данные</b>'
)

OBJECT_SELECT = (
    'Ввыберете объект, для которого хотите заполнить данные. Для этого нажмите на нужны объект, ничего вводить не надо:'
)

PEOPLE_SELECT = (
    'Введите количество людей на проекте:'
)

EQUIPMENT_SELECT = (
    'Введите информацию о спецтехнике на объекте:'
)

PLAN_SELECT = (
    'Выполнение плана за предыдущий день\n Нажмите на соотвествующую кнопку: ✅ - план был выполнен\n ❌ - план не был выполнен'
)

REPORT_DATE_SELECT = (
    'Введите план работы на отчетную дату:'
)

NOTES_SELECT = (
    'Введите примечания/проблемы:'
)

CONTRACTOR_SELECT = (
    'Выберете подрядчика:'
)

WRONG_COMAND = (
    'Нераспознанная команда'
)

SEND_DATA = (
    "Данные были отправлены"
)

CANCEL_SEND_DATA = (
    'Вы отказались от отправки данных'
)

NONAME_CONTRACTOR = (
    'Подрядчик не указан'
)

PLAN_COMPLATE = (
    'выполнено по плану'
)

PLAN_NOT_COMPLATE = (
    'не выполнено по плану'
)

USER_CHOICE = (
    'Вы выбрали <b>{}</b>'
)

DATA_GENERATE = (
    'Данные сформированы:\n{}\n\nПроверьте данные перед отправкой.\nДля отправки нажмите на кнопку <b>"Да"</b>, для отмены - <b>"Нет"</b>'
)

PHOTO_SELECT = (
    'Отправьте фотографии объекта.\n' + 
    'Данные фотографии будут переданы отвественному лицу.\n' +
    'Если по каким-то причинам фотографии отправлять не надо или их нет, напишите : <b>Нет</b>'
)

PHOTO_TEXT = (
    'Подрядчик\n<b>{}</b>\nпо объекту\n<b>{}</b>\n отправляет следующие фотографии:'
)

SOMETHING_WRONG = (
    'Что-то пошло не так.\nПожалуйста, попробуйте заполнить форму еще раз.\nЕсли проблема сохраниться обратитесь к ответсвенному лицу.\nПриносим извинения за неудобства.'
)

WORK_PLAN_NO_SELECT = (
    'Вы не выбрали выполнение плана за отчетный день.'
)